app/controllers/admin/coupons_controller.rb

SELECT "coupons".* FROM "coupons"
---
  def index
    @coupons = Coupon.all

SELECT "coupons".* FROM "coupons" WHERE "coupons"."id" = 3 LIMIT 1
---
  def show
    @coupon = Coupon.find(params[:id])

SELECT "coupons".* FROM "coupons" WHERE "coupons"."id" = 1 LIMIT 1
---
  def edit
    @coupon = Coupon.find(params[:id])

INSERT INTO "coupons" ("name", "code", "max_users", "validity", "created_at", "updated_at", "value", "no_users") VALUES ('Justin', 'justin', 100, '2012-09-12', '2011-09-12 14:32:09.285600', '2011-09-12 14:32:09.285600', 99, 0)
---
  def create
    @coupon = Coupon.new(params[:coupon])

    respond_to do |format|
      if @coupon.save

SELECT "coupons".* FROM "coupons" WHERE "coupons"."id" = 1 LIMIT 1
UPDATE "coupons" SET "name" = '99', "code" = '99', "value" = 99, "updated_at" = '2011-09-17 20:29:29.358336' WHERE "coupons"."id" = 1
---
  def update
    @coupon = Coupon.find(params[:id])

    respond_to do |format|
      if @coupon.update_attributes(params[:coupon])