app/controllers/admin/payment_options_controller.rb

SELECT "payment_options".* FROM "payment_options"
---
  def index
    @payment_options = PaymentOption.all