app/views/surveys/_form.html.haml

SELECT "loan_options".* FROM "loan_options"
---
		.selector_box.col5
			- LoanOption.all.each_with_index do |lo, i|