app/controllers/general_controller.rb

INSERT INTO "contact_us" ("name", "email", "company", "phone_number", "subject", "message", "created_at", "updated_at") VALUES ('Ranjit Pillai', 'ranji_pm@yahoo.co.in', '', '8327908988', 'General Support', 'gsdfgdfffffffffffff', '2011-09-12 10:50:58.220062', '2011-09-12 10:50:58.220062')
---
  def save_contact
    @contact = ContactUs.new(params[:contact_us])
    @contact.subject = params[:subject]
     respond_to do |format|
      if @contact.save