app/controllers/orders_controller.rb

  def create
    params[:order][:amount] = params[:amount]
    params[:order][:duration] = params[:duration]
    @order = Order.new(params[:order])
    params[:order][:name] = params[:order][:first_name] + " " + params[:order][:last_name] unless params[:order].blank?
    Rails.logger.info params.inspect
    @order.user = current_user
    host = request.instance_variable_get(:@env)["HTTP_HOST"]

    respond_to do |format|
       if @order.save
---
INSERT INTO "orders" ("user_id", "ip_address", "first_name", "last_name", "card_type", "card_expires_on", "created_at", "updated_at", "description", "amount", "status", "card_number", "card_verification", "card_exires_on", "email", "login", "password", "duration", "message", "tran", "name", "city", "country", "address1", "address2", "zip", "coupon", "state") VALUES (25, NULL, 'first', 'last', 'visa', '2012-08-01', '2011-09-12 14:35:20.240355', '2011-09-12 14:35:20.240355', NULL, 0.2995000000000019, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 3, NULL, NULL, 'Justin Kempiak', 'Chicago', 'USA', '700 N Green St,', '#501', '60642', NULL, 'IL')

  def calculate_amount
    session[:coupon] = ""
    session[:duration_price] = ""
    session[:duration_price] = ""
    session[:actual_price] = ""
    path_url = new_order_path
    session[:duration_price] = params["duration"]
    session[:actual_price] = params["duration"]
    session[:duration] = PaymentOption.find_by_amount(session[:duration_price]).name
    session[:duration_months] = PaymentOption.find_by_amount(session[:duration_price]).duration
    unless params["coupon"].blank?
      @coupon = Coupon.find_by_code(params["coupon"])
---
SELECT "payment_options".* FROM "payment_options" WHERE "payment_options"."amount" = 29.95 LIMIT 1
SELECT "coupons".* FROM "coupons" WHERE "coupons"."code" = 'DSC10' LIMIT 1